tap "archivebox/archivebox"
tap "brewforge/extras"
tap "lihaoyun6/tap"
brew "libtiff"
brew "bash"
brew "glib"
brew "curl"
brew "harfbuzz"
brew "ffmpeg"
brew "mkdocs", link: false
brew "pandoc"
brew "platformio"
brew "postgresql@17", restart_service: :changed
brew "qpdf"
brew "ruby"
brew "telnet"
brew "tree"
brew "wget"
brew "zsh"
cask "115"
cask "adrive"
cask "alfred"
cask "arduino-ide"
cask "bitwarden"
cask "coteditor"
cask "eudic"
cask "folo"
cask "font-maple-mono-nf-cn"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "imgotv"
cask "input-source-pro"
cask "intellij-idea"
cask "iterm2"
cask "kap"
cask "kobo"
cask "logi-options+"
cask "lyricsx-mxiris"
cask "motrix"
cask "openinterminal"
cask "qq"
cask "quickrecorder"
cask "raspberry-pi-imager"
cask "readdle-spark"
cask "skim"
cask "snipaste"
cask "spotify"
cask "steam"
cask "telegram-desktop"
cask "tencent-meeting"
cask "texworks"
cask "visual-studio-code"
cask "vnc-viewer"
cask "youku"
cask "zotero"
cask "zspace"
vscode "dotdevru.prettier-java"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "leafvmaple.verilog"
vscode "ms-vscode.cpptools"
vscode "platformio.platformio-ide"
vscode "tomoki1207.pdf"
